export const tetrominoItems= {
    //матрица рисунок для лежачей фигуры
    'I':[
        [0, 0, 0, 0],
        [1, 1, 1, 1],
        [0, 0, 0, 0],
        [0, 0, 0, 0]
    ],
    //L
    'J':[
        [0, 0, 0],
        [1, 1, 1],
        [0, 0, 0]
       
    ],
    //L наоборот
    'L':[
        [0, 0, 1],
        [1, 1, 1],
        [0, 0, 0]
       
    ],
    'O':[
        [1, 1],
        [1, 1]
    ],
    'S':[
        [0, 1, 1],
        [1, 1, 0],
        [0, 0, 0]
    ],
    'T':[
        [0, 1, 0],
        [1, 1, 1],
        [0, 0, 0]
    ]

};

    //покраска
export const colors= {
        'I':'cyan',
        'O':'yellow',
        'T':'purple',
        'S':'green',
        'Z':'red',
        'J':'blue',
        'L':'orange'
    }
    